sevstels/T962-PC-CC2540/src/DFU/lpc21isp.cpp
    *RealSize = 0;
    endPtr = NULL;

	int result = BT_Receive(residual_data, sizeof(residual_data), timeOutMilliseconds);
	length = strlen(residual_data);
	memcpy((void*)Ans, residual_data, length);
	*RealSize = length;
} */

//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
void DebugPrintf(const char *fmt, ...)
{
  int lines;
  char pTemp[2000];
  memset(pTemp, 0, sizeof(pTemp));
  va_list ap;
      
  va_start(ap, fmt);
  //vprintf(fmt, ap);
  vsprintf(pTemp, fmt, ap);      
  va_end(ap);

  std::string msg(pTemp);
  
  pCPage6->txt_info += msg.c_str();
  
  pCPage6->m_edit_info.SetWindowTextA(pCPage6->txt_info);
  lines = pCPage6->m_edit_info.GetLineCount();
  pCPage6->m_edit_info.LineScroll(lines);
  //pCPage6->m_edit_info.UpdateWindow();
  ///TRACE(pTemp);
}

//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
int BT_Send(const char *pString)
{
  int length = strlen(pString);
  pCPage6->ev_BootDataRx.ResetEvent();
  
  int result = pBLE->Tx(CMD_NRF_OVEN_PROG_DATA, (char*)pString, length);

  //100 ms delay after each block (makes lpc21isp to work with bad UARTs)
  Sleep(20); 

  return result;
}

//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
int BT_Receive(void *pBuf, int size, unsigned timeout)
{  
  memset(pBuf, 0, size);
  
  DWORD ret = WaitForSingleObject(pCPage6->ev_BootDataRx.m_hObject, timeout);
  //TRACE1("%d\n", ret);

  int copy_length;
  if(ret==0)
  {
	int length = pCPage6->bootloader_msg.length();
	if(length<=size) copy_length = length;
	else { copy_length = size;}

	memcpy(pBuf, pCPage6->bootloader_msg.c_str(), copy_length);
	return 1;
  }

  /*
  if(ok==1) TRACE1("%s\n", buf2);
  */

  return -1;
}

//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
static void NxpOutputErrorMessage(unsigned char ErrorNumber)
{
    switch (ErrorNumber)
    {
    case   0:
        DebugPrintf( "CMD_SUCCESS\n");
        break;

    case   1:
        DebugPrintf( "INVALID_COMMAND\n");
        break;

    case   2:
        DebugPrintf( "SRC_ADDR_ERROR: Source address is not on word boundary.\n");
        break;

    case   3:
        DebugPrintf( "DST_ADDR_ERROR: Destination address is not on a correct boundary.\n");
        break;

    case   4:
        DebugPrintf( "SRC_ADDR_NOT_MAPPED: Source address is not mapped in the memory map.\n"
                       "                     Count value is taken into consideration where applicable.\n");
        break;

    case   5:
        DebugPrintf( "DST_ADDR_NOT_MAPPED: Destination address is not mapped in the memory map.\n"
                       "                     Count value is taken into consideration where applicable.\n");
        break;

    case   6:
        DebugPrintf( "COUNT_ERROR: Byte count is not multiple of 4 or is not a permitted value.\n");
        break;

    case   7:
        DebugPrintf( "INVALID_SECTOR: Sector number is invalid or end sector number is\n"
                       "                greater than start sector number.\n");
        break;

    case   8:
        DebugPrintf( "SECTOR_NOT_BLANK\n");
        break;

    case   9:
        DebugPrintf( "SECTOR_NOT_PREPARED_FOR_WRITE_OPERATION:\n"
                       "Command to prepare sector for write operation was not executed.\n");
        break;

    case  10:
        DebugPrintf( "COMPARE_ERROR: Source and destination data not equal.\n");
        break;

    case  11:
        DebugPrintf( "BUSY: Flash programming hardware interface is busy.\n");
        break;

    case  12:
        DebugPrintf( "PARAM_ERROR: Insufficient number of parameters or invalid parameter.\n");
        break;

    case  13:
        DebugPrintf( "ADDR_ERROR: Address is not on word boundary.\n");
        break;

    case  14:
        DebugPrintf( "ADDR_NOT_MAPPED: Address is not mapped in the memory map.\n"
                       "                 Count value is taken in to consideration where applicable.\n");
        break;

    case  15:
        DebugPrintf( "CMD_LOCKED\n");
        break;

    case  16:
        DebugPrintf( "INVALID_CODE: Unlock code is invalid.\n");
        break;

    case  17:
        DebugPrintf( "INVALID_BAUD_RATE: Invalid baud rate setting.\n");
        break;

    case  18:
        DebugPrintf( "INVALID_STOP_BIT: Invalid stop bit setting.\n");
        break;

    case  19:
        DebugPrintf( "CODE READ PROTECTION ENABLED\n");
        break;

    case 255:
        break;

    default:
        DebugPrintf( "unknown error %u\n", ErrorNumber);
        break;
    }

    //DebugPrintf( "error (%u), see  NxpOutputErrorMessage() in lpc21isp.c for help \n\r", ErrorNumber);
}

/***************************** GetAndReportErrorNumber ***************************/
/**  Find error number in string.  This will normally be the string
returned from the microcontroller.
\param [in] Answer the buffer to search for the error number.
\return the error number found, if no linefeed found before the end of the
string an error value of 255 is returned. If a non-numeric value is found
then it is printed to stdout and an error value of 255 is returned.
*/
//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
static unsigned char GetAndReportErrorNumber(const char *Answer)
{
    unsigned char Result = 0xFF; // Error !!!
    unsigned int i = 0;

    while (1)
    {
        if (Answer[i] == 0x00)
        {
            break;
        }

        if (Answer[i] == 0x0a)
        {
            i++;

            if (Answer[i] < '0' || Answer[i] > '9')
            {
                DebugPrintf( "ErrorString: %s", &Answer[i]);
                break;
            }

            Result = (unsigned char) (atoi(&Answer[i]));
            break;
        }

        i++;
    }

    NxpOutputErrorMessage(Result);

    return Result;
}

#include <stdio.h>

  //-----------------------------------------------------------------
  //vars Puffer for data to resend after "RESEND\r\n" Target responce
  char sendbuf0[128];
  char sendbuf1[128];
  char sendbuf2[128];
  char sendbuf3[128];
  char sendbuf4[128];
  char sendbuf5[128];
  char sendbuf6[128];
  char sendbuf7[128];
  char sendbuf8[128];
  char sendbuf9[128];
  char sendbuf10[128];
  char sendbuf11[128];
  char sendbuf12[128];
  char sendbuf13[128];
  char sendbuf14[128];
  char sendbuf15[128];
  char sendbuf16[128];
  char sendbuf17[128];
  char sendbuf18[128];
  char sendbuf19[128];

  char * sendbuf[20] = { sendbuf0,  sendbuf1,  sendbuf2,  sendbuf3,  sendbuf4,
                         sendbuf5,  sendbuf6,  sendbuf7,  sendbuf8,  sendbuf9,
                         sendbuf10, sendbuf11, sendbuf12, sendbuf13, sendbuf14,
                         sendbuf15, sendbuf16, sendbuf17, sendbuf18, sendbuf19};

  char uuencode_table[64];
  int kk;
  unsigned long block_CRC = 0;
//------------------------------------------------------------------------------
//Function:
//------------------------------------------------------------------------------
int NxpDownload(ISP_ENVIRONMENT *IspEnvironment)
{
//  unsigned long realsize;
  char Answer[128];
  char *endPtr;
  int found;
  unsigned long Sector;
  unsigned long SectorLength;
  unsigned long SectorStart, SectorOffset, SectorChunk;
  char tmpString[128];
  //unsigned long BlockOffset;
  //unsigned long Block;
  unsigned long Pos;
  unsigned long Id[2];
  unsigned long Id1Masked;
  unsigned long CopyLength;
  int i;
  //CRC over interrupt vector table
  unsigned long ivt_CRC;
  int repeat = 0;
  int result;
  kk = 0;

  //очистить буфер экрана 
  pCPage6->txt_info.Empty();
  pCPage6->Progress_Ini(IspEnvironment->BinaryLength);

  //===========================================================
  //Переключить процессор печи в режим программирования
  //===========================================================
  //Смотрим в сетапе у печки возможность перехода прямо в бут
/*  if(pCPage6->pDevice->Bootloader>0)
  {
  
