sevstels/T962-PC-CC2540/src/DFU/lpc21isp.cpp
  }*/
  /*
  result = pBLE->Tx(CMD_CHECK_BOOTLOADER, NULL, 0);
  if(!result){ return (NO_ANSWER_QM);}

  result = BT_Receive(Answer, sizeof(Answer), 1000);
  if(result==1)
  {
	 std::string boot_answ(Answer); 
	 result = boot_answ.find("BootOK");
	 if(result>=0)
	 {
		DebugPrintf("Jump to Bootloader mode\r\n");
	 }
  }
  else 
  {
     result = pBLE->Tx(CMD_NRF_OVEN_JUMP_TO_BOOTLOADER, NULL, 0);
     if(!result){ return (NO_ANSWER_QM);} 
	// DebugPrintf("Jump to Bootloader mode by Reset\r\n");
  }	*/	 

  result = pBLE->Tx(CMD_NRF_OVEN_ISP_MODE, NULL, 0);
 /* if(!result){ return (NO_ANSWER_QM);} 
  */
 // result = pBLE->Tx(CMD_NRF_OVEN_JUMP_TO_BOOTLOADER, NULL, 0);

  //===========================================================
  //ждем перехода в загрузку 
  Sleep(1000);
  DebugPrintf("Connect ");
  found = 0;

  //инициализация auto boud
  for(int i=0; i<40; i++)
  {	  
	 //посылаем ? для работы алгоритма
     result = BT_Send("?\r\n");
	 if(!result)
	 { 
	   return (NO_ANSWER_QM);
	 }
	 
	 //ждем ответ
	 result = BT_Receive(Answer, sizeof(Answer), 200);
	 if(result==1)
	 {
	    std::string boot_answ(Answer); 
		result = boot_answ.find("Synchronized");
		
		if(result>=0)
		{
		  found = 1;
		  break;
		}
	 }

	 DebugPrintf(".");
  }

  if(found==0)
  {
    DebugPrintf(" Error\r\n");
	  
	//no answer on '?'\n
	DebugPrintf("Chip no answer, Reset\r\n");
	//Reset device!
	///pBLE->Tx(CMD_NRF_OVEN_RESET, NULL, 0);
	Sleep(1000);
    return (NO_ANSWER_QM);
  }

  DebugPrintf( " OK\r\n");


  //===========================================================
  DebugPrintf("Synchronized: ");
  //проверка перехода процессора в boot mode по эху
  //53 79 6E 63 68 72 6F 6E 69 7A 65 64 0D 0A 
  found=0;
  result = BT_Send("Synchronized\r\n");
  if(!result){ return (NO_ANSWER_QM);}
 
  //ждем ответ for Synchronized = OK
  result = BT_Receive(Answer, sizeof(Answer), 1000);
  if(result==1)
  {
	 std::string boot_answ(Answer); 
     result = boot_answ.find("Synchronized\r\nOK");
		
	 if(result>=0)
	 {
		found = 1;
	 }
  }	

  if(found==0)
  {
    DebugPrintf( "Error, No answer, Reset\r\n");
    //Reset device!
	pBLE->Tx(CMD_NRF_OVEN_RESET, NULL, 0);
	Sleep(1000);
    return (NO_ANSWER_SYNC);
  }	

  DebugPrintf("OK\r\n");

  //===========================================================
  DebugPrintf("Set Oscillator Freq: ");  
  found = 0; 
  result = BT_Send("014740\r\n");
  if(!result){ return (NO_ANSWER_QM);}
  
  //ждем ответ
  result = BT_Receive(Answer, sizeof(Answer), 1000);
  if(result==1)
  {
	std::string answ(Answer); 
	result = answ.find("014740\r\nOK");	
	if(result>=0)
	{ 
	   found = 1;
	   DebugPrintf("14740 KHz\r\n"); 
	}
  }  
	
  if(found==0)
  {
    DebugPrintf( "Error, No answer\r\n");
	//Reset device!
	pBLE->Tx(CMD_NRF_OVEN_RESET, NULL, 0);
    return (NO_ANSWER_OSC);
  }

  //===========================================================
  DebugPrintf("Chip Unlock: ");

  BT_Send("U 23130\r\n");
  result = BT_Receive(Answer, sizeof(Answer), 1000);
  if(!result)
  {
    DebugPrintf( "Error\r\n");
	//Reset device!
	pBLE->Tx(CMD_NRF_OVEN_RESET, NULL, 0);
    return (UNLOCK_ERROR + GetAndReportErrorNumber(Answer));
  }
  DebugPrintf("OK\r\n");

  //===========================================================
  DebugPrintf( "BootCode version: ");

  BT_Send("K\r\n");
  result = BT_Receive(Answer, sizeof(Answer), 1000);
  if(result != 1)
  {
    DebugPrintf( "Error, No answer\r\n");
    return (NO_ANSWER_RBV);
  }
  else
  {
    std::string answ(Answer); 
	result = answ.find("\r\n0\r\n");	
	if(result>0)
	{ 
	  answ.erase(0, result+5);

	  int maj, min, build;
	  if(sscanf(answ.c_str(), "%d %d %d", &build, &min, &maj) == 2) 
	  {
        maj = min;
        min = build;
        build = 0;
		DebugPrintf( "%d.%d.%d\r\n", maj, min, build);
      }
      else
      {
        DebugPrintf("Unknown\r\n");
      }
	}
  }

  //===========================================================
  DebugPrintf("Part ID: ");
  
  BT_Send("J\r\n");
  result = BT_Receive(Answer, sizeof(Answer), 1000);
  memcpy(Answer, &Answer[6], 6);
  memset(&Answer[6], 0, 12);
  
  //----
  std::string id(Answer);
  endPtr = "\r\n";

  Id[0] = strtoul(id.c_str(), &endPtr, 10);
  Id[1] = 0UL;
  
  i = sizeof(LPCtypes)/sizeof(LPCtypes[0])-1;
  for (i; i > 0 && LPCtypes[i].id != Id[0]; i--){};
  IspEnvironment->DetectedDevice = i;
  
  if(LPCtypes[IspEnvironment->DetectedDevice].EvalId2 != 0)
  {
        /* Read out the second configuration word and run the search again */
        *endPtr = '\n';
        endPtr++;
        if ((endPtr[0] == '\0') || (endPtr[strlen(endPtr)-1] != '\n'))
        {
            /* No or incomplete word 2 */
			//debug this!!!
		    result = BT_Receive(Answer, sizeof(Answer), 1000);
        }

		//отладить это
        ///FormatCommand(endPtr, endPtr);
        if ((*endPtr == '\0') || (*endPtr == '\n'))
        {
            DebugPrintf( "incomplete answer on Read Part Id (second configuration word missing)\r\n");
            return (NO_ANSWER_RPID);
        }

        Id[1] = strtoul(endPtr, &endPtr, 10);
        *endPtr = '\0'; /* delete \r\n */

        Id1Masked = Id[1] & 0xFF;

        /* now search the table again */
        for (i = sizeof LPCtypes / sizeof LPCtypes[0] - 1; i > 0 && (LPCtypes[i].id != Id[0] || LPCtypes[i].id2 != Id1Masked); i--)
            /* nothing */;
        IspEnvironment->DetectedDevice = i;
    }

    if(IspEnvironment->DetectedDevice == 0)
	{
        DebugPrintf( "unknown");
    }
    else 
	{
        DebugPrintf( "LPC%s, %d kiB FLASH / %d kiB SRAM",
            LPCtypes[IspEnvironment->DetectedDevice].Product,
            LPCtypes[IspEnvironment->DetectedDevice].FlashSize,
            LPCtypes[IspEnvironment->DetectedDevice].RAMSize);
    }
    
	if(LPCtypes[IspEnvironment->DetectedDevice].EvalId2 != 0)
    {
        DebugPrintf( " (0x%08lX / 0x%08lX -> %08lX)\r\n", Id[0], Id[1], Id1Masked);
    }
    else
    {
        DebugPrintf( " (0x%08lX)\r\n", Id[0]);
    }

    if(!IspEnvironment->DetectOnly)
    {
        // Build up uuencode table
        uuencode_table[0] = 0x60;           // 0x20 is translated to 0x60 !

