sevstels/T962-PC-CC2540/src/DFU/lpc21isp.cpp
        for (i = 1; i < 64; i++)
        {
            uuencode_table[i] = (char)(0x20 + i);
        }

        if(LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC2XXX)
        {
            // Patch 0x14, otherwise it is not running and jumps to boot mode
            ivt_CRC = 0;

            // Clear the vector at 0x14 so it doesn't affect the checksum:
            for (i = 0; i < 4; i++)
            {
                IspEnvironment->BinaryContent[i + 0x14] = 0;
            }

            // Calculate a native checksum of the little endian vector table:
            for (i = 0; i < (4 * 8);) {
                ivt_CRC += IspEnvironment->BinaryContent[i++];
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 8;
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 16;
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 24;
            }

            /* Negate the result and place in the vector at 0x14 as little endian
            * again. The resulting vector table should checksum to 0. */
            ivt_CRC = (unsigned long) (0 - ivt_CRC);
            for (i = 0; i < 4; i++)
            {
                IspEnvironment->BinaryContent[i + 0x14] = (unsigned char)(ivt_CRC >> (8 * i));
            }

            DebugPrintf("Position 0x14 patched: ivt_CRC = 0x%08lX\r\n", ivt_CRC);
        }
        else if(LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC43XX ||
                LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC18XX ||
                LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC17XX ||
                LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC13XX ||
                LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC11XX ||
                LPCtypes[IspEnvironment->DetectedDevice].ChipVariant == CHIP_VARIANT_LPC8XX)
        {
            // Patch 0x1C, otherwise it is not running and jumps to boot mode

            ivt_CRC = 0;

            // Clear the vector at 0x1C so it doesn't affect the checksum:
            for (i = 0; i < 4; i++)
            {
                IspEnvironment->BinaryContent[i + 0x1C] = 0;
            }

            // Calculate a native checksum of the little endian vector table:
            for (i = 0; i < (4 * 8);) {
                ivt_CRC += IspEnvironment->BinaryContent[i++];
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 8;
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 16;
                ivt_CRC += IspEnvironment->BinaryContent[i++] << 24;
            }

            /* Negate the result and place in the vector at 0x1C as little endian
            * again. The resulting vector table should checksum to 0. */
            ivt_CRC = (unsigned long) (0 - ivt_CRC);
            for (i = 0; i < 4; i++)
            {
                IspEnvironment->BinaryContent[i + 0x1C] = (unsigned char)(ivt_CRC >> (8 * i));
            }

            DebugPrintf("Position 0x1C patched: ivt_CRC = 0x%08lX\r\n", ivt_CRC);
        }
        else
        {
          DebugPrintf( "Internal error: wrong chip variant %d (detected device %d)\r\n", LPCtypes[IspEnvironment->DetectedDevice].ChipVariant, IspEnvironment->DetectedDevice);
          return -1;
        }
    }

    /* In case of a download to RAM, use full RAM for downloading
    * set the flash parameters to full RAM also.
    * This makes sure that all code is downloaded as one big sector */
    if ( (IspEnvironment->BinaryOffset >= ReturnValueLpcRamStart(IspEnvironment))
       &&(IspEnvironment->BinaryOffset + IspEnvironment->BinaryLength <= ReturnValueLpcRamStart(IspEnvironment)+(LPCtypes[IspEnvironment->DetectedDevice].RAMSize*1024)))
    {
        LPCtypes[IspEnvironment->DetectedDevice].FlashSectors = 1;
        LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize  = LPCtypes[IspEnvironment->DetectedDevice].RAMSize*1024 - (ReturnValueLpcRamBase(IspEnvironment) - ReturnValueLpcRamStart(IspEnvironment));
        LPCtypes[IspEnvironment->DetectedDevice].SectorTable  = SectorTable_RAM;
        SectorTable_RAM[0] = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
    }

    if(IspEnvironment->DetectOnly) return (0);

    // Start with sector 1 and go upward... Sector 0 containing the interrupt vectors
    // will be loaded last, since it contains a checksum and device will re-enter
    // bootloader mode as long as this checksum is invalid.
    DebugPrintf("Will start programming at Sector 1\r\nSector 0 to ensure that checksum is written last\r\n");
    if(LPCtypes[IspEnvironment->DetectedDevice].SectorTable[0] >= IspEnvironment->BinaryLength)
    {
        Sector = 0;
        SectorStart = 0;
    }
    else
    {
        SectorStart = LPCtypes[IspEnvironment->DetectedDevice].SectorTable[0];
        Sector = 1;
    }
	/*
	//---------------------------------------------
	//Erase
	//---------------------------------------------
    if(IspEnvironment->WipeDevice == 1) 
	{ 
	  int ret = EraseChip(IspEnvironment);
	  if(ret !=0) return ret;
	}
    else
	{ 
	//   int ret = EraseSector(IspEnvironment);
	//   if(ret !=0) return ret;
    } */

	
  int ret;
 // ret = Chip_Erase(IspEnvironment);
  Sleep(100);
  /*
  for(i=0;i<9; i++){ DebugPrintf("\r\nSector %ld: ", i); ret = EraseSector(IspEnvironment, i);}
  // return 0;	 */
  //EraseSector(IspEnvironment, 0);
  
 // Sector = 8;

  //---------------------------------------------
  //Write loop
  //---------------------------------------------
  while(1)
  {
    DebugPrintf("\r\nSector %ld: ", Sector);
	
    //----
    if(Sector >= LPCtypes[IspEnvironment->DetectedDevice].FlashSectors)
    {
      DebugPrintf( "\r\nProgram too large, out of Flash memory.\r\n");
      return (PROGRAM_TOO_LARGE);
    }		
	
	//Проверить сектор на чистоту
	result = Sector_CheckEmpty(Sector);
	if(result!=1)
	{ 
	  //сектор грязный
	  result = Sector_Erase(Sector);
	  if(result!=1)  return 1000;
	}
	        
	SectorLength = LPCtypes[IspEnvironment->DetectedDevice].SectorTable[Sector];
    if(SectorLength > IspEnvironment->BinaryLength - SectorStart)
    {
      SectorLength = IspEnvironment->BinaryLength - SectorStart;
    }
 
	for(SectorOffset = 0; SectorOffset < SectorLength; SectorOffset += SectorChunk)
    {
      // Check if we are to write only 0xFFs - it would be just a waste of time..
      if(SectorOffset == 0)
	  {
        for(SectorOffset = 0; SectorOffset < SectorLength; ++SectorOffset)
        {
          if(IspEnvironment->BinaryContent[SectorStart + SectorOffset] != 0xFF)
          break;
        }

        // all data contents were 0xFFs        
		if(SectorOffset == SectorLength) 
        {
          DebugPrintf( "Whole sector contents is 0xFFs, skipping programming.");
          break;
        }

        // re-set otherwise        
		SectorOffset = 0; 
      }
	  
	  //Add a visible marker between segments in a sector
      if(SectorOffset > 0)
      {
        //means: partial segment copied 
        DebugPrintf( "|");  
      }

      //If the Flash ROM sector size is bigger than the number of bytes
      // we can copy from RAM to Flash, we must "chop up" the sector and
      // copy these individually.
      // This is especially needed in the case where a Flash sector is
      // bigger than the amount of SRAM.
      SectorChunk = SectorLength - SectorOffset;
      if(SectorChunk > (unsigned)LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize)
      {
        SectorChunk = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
      }

      //Write multiple of 45 * 4 Byte blocks to RAM, but copy maximum of on sector to Flash
      //In worst case we transfer up to 180 byte too much to RAM
      //but then we can always use full 45 byte blocks and length is multiple of 4
      CopyLength = SectorChunk;
      if((CopyLength % (45 * 4)) != 0)
      {
        CopyLength += ((45 * 4) - (CopyLength % (45 * 4)));
      }

	  //Write to RAM W <start address> <number of bytes>
	  unsigned long ram_addr = ReturnValueLpcRamBase(IspEnvironment);
	  result = Write_ToRAM(ram_addr, CopyLength);
      if(result!=1)
      {
        DebugPrintf( "Wrong answer on Write-Command\n");
        return (WRONG_ANSWER_WRIT + GetAndReportErrorNumber(Answer));
      }

