sevstels/T962-PC-CC2540/src/DFU/lpc21isp.cpp
      Resend:
      int Line = 0;
	  unsigned long block_crc=0;

      //Transfer blocks of 45 * 4 bytes to RAM
      for(Pos = SectorStart + SectorOffset; 
		 (Pos < SectorStart + SectorOffset + CopyLength) && 
		 (Pos < IspEnvironment->BinaryLength); Pos += (45 * 4))
      {
		int ret = Copy_ToRAM(IspEnvironment, Pos, Line, block_crc);
		if(ret!=1){ return 1000;}
	  }
		
	  if(Line != 0)
      {
	    result = Check_CRC(block_crc);
        if(result<0)
	    {	
		  DebugPrintf( "Error on send block CRC\r\n");
		  return 1000;
	     }
	  }
  


      if((IspEnvironment->BinaryOffset < ReturnValueLpcRamStart(IspEnvironment)) || 
         (IspEnvironment->BinaryOffset >= ReturnValueLpcRamStart(IspEnvironment)+
		 (LPCtypes[IspEnvironment->DetectedDevice].RAMSize*1024)))
      {
        //Prepare command must be repeated before every write				 
		result = Sector_Prepare(Sector);
		if(result==0) goto Resend; 
	    if(result==-1) return (WRONG_ANSWER_PREP2);
		

        // Round CopyLength up to one of the following values: 512, 1024,
        // 4096, 8192; but do not exceed the maximum copy size (usually 8192, but chip-dependent)
        if(CopyLength < 512)
        {
          CopyLength = 512;
        }
        else if(SectorLength < 1024)
        {
          CopyLength = 1024;
        }
        else if (SectorLength < 4096)
        {
          CopyLength = 4096;
        }
        else
        {
          CopyLength = 8192;
        }

        //----
		if(CopyLength > (unsigned)LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize)
        {
          CopyLength = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
        }

	    //Copy RAM to Flash				
		int cstart = IspEnvironment->BinaryOffset + SectorStart + SectorOffset;
		int cbase = ReturnValueLpcRamBase(IspEnvironment); 
		result = Copy_ToFlash(cstart, cbase, CopyLength);
		if(result !=1) return 1;

        if(IspEnvironment->Verify)
        {

          //Avoid compare first 64 bytes.
          //Because first 64 bytes are re-mapped to flash boot sector,
          //and the compare result may not be correct.
          if (SectorStart + SectorOffset<64)
          {
            sprintf(tmpString, "M %d %ld %ld\r\n", 64, ReturnValueLpcRamBase(IspEnvironment) + 
				   (64 - SectorStart - SectorOffset), CopyLength-(64 - SectorStart - SectorOffset));
          }
          else
          {		
            sprintf(tmpString, "M %ld %ld %ld\r\n", SectorStart + 
				    SectorOffset, ReturnValueLpcRamBase(IspEnvironment), CopyLength);
          }
					
		  result = Sector_Verify(tmpString);
          if(result!=1) 
		  {
            DebugPrintf( "Wrong answer on Compare-Command\r\n");
            //return (WRONG_ANSWER_COPY + GetAndReportErrorNumber(Answer));
          }  
         }
        }
       }

       if ((SectorStart + SectorLength) >= IspEnvironment->BinaryLength && Sector!=0)
        {
            Sector = 0;
            SectorStart = 0;
        }
        else if (Sector == 0)
		{
          break;
        }
        else 
		{
          SectorStart += LPCtypes[IspEnvironment->DetectedDevice].SectorTable[Sector];
          Sector++;
        }
    }

  //int prog_time_min = (tDone.wHour-tStart.wHour)*60 + tStart.wMinute-tDone.wMinute;
  if(IspEnvironment->Verify)
     DebugPrintf("\r\nDownload Finished\r\nVerified correct");
  else
     DebugPrintf("\r\nDownload Finished");

  /*
  if(IspEnvironment->DoNotStart == 0)
  {
    DebugPrintf("\r\nLaunching the new code");
    sprintf(tmpString, "G %ld A\r\n", IspEnvironment->StartAddress);
	BT_Send(tmpString);
  }	
  else DebugPrintf("\r\nPress 'Oven Reset' for Launch the new code");	 */
  
  DebugPrintf("\r\nPress 'Oven Reset' for Launch the new code");
  return 0;
}

/*
Sector 8: Empty
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   1
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   2
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   3
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   4
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   5
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   6
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   7
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  OK
|
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20   8
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 
01 02 03 04 05 06 07 08 09 10 11 12  CRC OK
Write  OK, Verify  Error!
Wrong answer on Compare-Command
ErrorString: OK
*/